/*
void ShowQuart(int quartNum)
{
    if(quartNum >=1 && quartNum <=4)
    {

    }
    else 
        Console.WriteLine("")
}
*/



// Задача 1. Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

// Задача 1. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.
